{
  "users": [
    {
      "id": "1",
      "name": "Ilya Alpatov",
      "login": "test@mail.ru",
      "password": "qwerty123"
    }
  ],
  "categories": [
    {
      "id": "0",
      "title": "hot"
    },
    {
      "id": "1",
      "title": "animal"
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": "Apple разрешила скачивать приложения на iPhone прямо из интернета, но только в ЕС",
      "description": "Компания Apple анонсировала несколько дополнительных изменений в своей политике, которые дадут разработчикам приложений для iOS из Евросоюза больше свободы. Например, они смогут распространять свои приложения непосредственно через свои веб-сайты, самостоятельно выбирать, как будут выглядеть рекламные акции внутри приложений, и др. Ранее в этом месяце Apple выпустила iOS 17.4, в которой реализована поддержка сторонних магазинов приложений с каталогом продуктов сторонних разработчиков, а также собственными приложениями создателя площадки. Теперь же стала доступна возможность создания магазинов для распространения только своих приложений. К примеру, игровая студия может создать магазин приложений для iOS, предлагающий исключительно собственные продукты. Направляя пользователей для проведения транзакций на свой сайт, разработчики теперь могут выбирать, как оформлять рекламные акции, скидки и другие предложения внутри своих приложений. Начиная с сегодняшнего дня, разработчикам не обязательно придерживаться специального шаблона Apple для оформления рекламных акций. В дополнение к этому разработчики смогут распространять приложения непосредственно со своих сайтов при условии, что они соответствуют определённым критериям Apple. К таким критериям относится участие в программе Apple Developer Program в течение двух и более лет, а также наличие у разработчика продуктов с более чем 1 млн установок на iOS в Евросоюзе в предыдущем году. В дополнение к этому разработчики должны соблюдать требования Apple в плане конфиденциальности при сборе и обработке данных пользователей. Распространяемые таким образом приложения должны соответствовать требованиям Apple, как и другие приложения для iOS, а распространяться они смогут только с сайтов, зарегистрированных в App Store Connect. Авторизованные разработчики смогут получить доступ к специальному API, который сделает проще процесс распространения приложений через интернет, а также облегчит интеграцию с системными функциями, резервное копирование, восстановление данных и др. Возможность распространения приложений через веб-сайты станет доступна после выхода следующей версии iOS весной этого года. Таким образом, Apple впервые позволит загружать программные продукты для iOS непосредственно с веб-сайтов.",
      "date": "12.03.2024",
      "category": "hot"
    },
    {
      "id": "1",
      "title": "\"Знакомьтесь!\" В Сочи сообщили о пополнении в семье спасенных дикобразов",
      "description": "\"Малышка появилась на свет зрячей, зубастой и с мягкими иглами. Первые две недели она питается материнским молоком, потом родители будут докармливать ее растительной пищей и, конечно-же, овсяными печеньками. Так что, впереди у Марты безмятежная и сладкая жизнь\"",
      "date": "12.03.2024",
      "category": "animal"
    }
  ]
}